#!/usr/bin/env python3
# -*- coding: utf-8 -*-

def run():
    # В саду сорвали цветы
    garden = ('ромашка', 'роза', 'одуванчик', 'ромашка', 'гладиолус', 'подсолнух', 'роза', )

    # На лугу сорвали цветы
    meadow = ('клевер', 'одуванчик', 'ромашка', 'клевер', 'мак', 'одуванчик', 'ромашка', )

    # Создайте множество цветов, произрастающих в саду и на лугу
    # garden_set =
    # meadow_set =
    # TODO здесь ваш код
    garden_set = set(garden)
    meadow_set = set(meadow)

    # Выведите на консоль все виды цветов
    # TODO здесь ваш код
    print(garden_set | meadow_set)
    # Выведите на консоль те, которые растут и там и там
    # TODO здесь ваш код
    print(garden_set & meadow_set)

    # Выведите на консоль те, которые растут в саду, но не растут на лугу
    # TODO здесь ваш код
    print(garden_set - meadow_set)

    # Выведите на консоль те, которые растут на лугу, но не растут в саду
    # TODO здесь ваш код
    print(meadow_set - garden_set)


if __name__ == '__main__':
    run()